{
  "_name_or_path": "prithivMLmods/deepfake-detector-model-v1",
  "architectures": [
    "SiglipForImageClassification"
  ],
  "id2label": {
    "0": "Fake",
    "1": "Real"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "Fake": 0,
    "Real": 1
  },
  "model_type": "siglip",
  "problem_type": "single_label_classification",
  "text_config": {
    "model_type": "siglip_text_model",
    "projection_size": 768,
    "torch_dtype": "float32",
    "vocab_size": 256000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "vision_config": {
    "model_type": "siglip_vision_model",
    "torch_dtype": "float32"
  }
}
